{
    "title": "Preventive Nutrition, 5th ed: The Comprehensive Guide for Health Professionals",
    "author": "Adrianne Bendich",
    "desc": "This newly expanded and updated fifth edition will be the largest and most comprehensive of the five editions and new topics and chapter authors have been added. The authors have created the most comprehensive and up-to-date review of the nutritional strategies available for the prevention of disease and the promotion of health through nutrition. Patients are looking for credible information from their health care providers about a whole range of subjects covered here, including ß-carotene, lycopene, antioxidants, folate, and the myriad of bioactive phytochemicals found in garlic and other foods. With sections on cardiovascular disease, diabetes, and pregnancy among many others, this volume will be of great value to practicing health professionals, including physicians, nutritionists, dentists, pharmacists, dieticians, health educators, policy makers, health economists, regulatory agencies and research investigators. An entire section covers nutrition transitions around the world including Eastern Europe, Latin America and Asia as well as goals for preventive nutrition in developing countries.Preventive Nutrition: The Comprehensive Guide for Health Professionals, 5th Ed. is an important resource for thousands of health professionals who have been utilizing the previous editions since 1997.",
    "img_url": "https://s3proxy.cdn-zlib.se/covers299/collections/genesis/4c5312f612740b906238cc3c8fa328e851e1c7274ea97bea8ddace962cd3a1e8.jpg",
    "Categories": "Medicine - Health-Related Professions",
    "Year": "2015",
    "Edition": "5",
    "Publisher": "Springer International Publishing",
    "Language": "english",
    "Pages": "913",
    "ISBN 10": "331922431X",
    "ISBN 13": "9783319224312",
    "Series": "Nutrition and Health",
    "File": "PDF, 14.03 MB",
    "IPFS CID": "QmX56EXNv6biXJ3ScT18nfwVzv5aLJDhLG4NG6E28nXs1a",
    "IPFS CID blake2b": "bafykbzacecehoxg3u2gemvswov7j6nzxzxniryedkzjenuqqvqaxzrjrgdbqo"
}