{
    "title": "Engineering Design: A Survival Guide to Senior Capstone",
    "author": "Cory J. Mettler",
    "desc": "Engineering Senior Design is perhaps the course that most resembles what an engineering professional will be required to do during their career; it is the bridge between the academic classroom and the engineering profession. This textbook will support students as they learn to apply their previously-developed skills to solve a complex engineering problem during a senior-level design course. This textbook follows the design life cycle from project initiation to completion and introduces students to many soft engineering skills, such as communication, scheduling, and technical writing, in the context of an engineering design. Students are instructed how to define an engineering problem with a valid problem statement and requirements document. They will conceptualize a complex solution and divide that solution into manageable subsystems. More importantly, they will be introduced to Project Management techniques that will help students organize workloads, develop functional engineering-teams, and validate solutions, all while increasing the likelihood of a successful completion to the project. Throughout the experience, students are instructed that a well-intentioned solution is not particularly useful unless it can be communicated and documented. To that end, this textbook will help students document their work in a professional manner and to present their ideas to stakeholders in a variety of formal design-reviews. With the support of this textbook, by the end of a student’s senior design experience, each individual will be ready to communicate with other engineering professionals, effectively support engineering design-teams, and manage complex project to solve the next generation’s engineering challenges.",
    "img_url": "https://s3proxy.cdn-zlib.se/covers299/collections/userbooks/813fdf0e98742bef7ae3b9507654a27592d8db56ff673ab868e64572b61738a0.jpg",
    "Categories": "Engineering - Engineering Technology",
    "Year": "2023",
    "Publisher": "Springer",
    "Language": "english",
    "Pages": "442",
    "ISBN 10": "3031233085",
    "ISBN 13": "9783031233081",
    "File": "PDF, 19.79 MB",
    "IPFS CID": "QmRxYGcHxPYN5ecMxeeUogu9zPFzsL1QRW5gwYrVNTFX6X",
    "IPFS CID blake2b": "bafykbzaced276xhyxafvohhtkbawqmng4sr73lt7wxyuy3xyo6cpjfnb47m6w"
}