{
    "title": "The Quick and the Dead Total Training for the Advanced Minimalist",
    "author": "Pavel Tsatsouline",
    "desc": "Total Training for the Advanced MinimalistYou are strong or used to be.You take pride in your all-around physical development—but have precious little time for it. You are serving your country, raising a family, training for a sport…You have been around too long to be fooled by pop fitness \"high intensity\" fads.The Quick and the Dead is designed for an advanced minimalist like you. A culmination of five years of research and experimentation, it distills cutting-edge science to a straightforward protocol of only two basic exercises you mastered years ago: kettlebell swings and power pushups.Q&D delivers. A highly ranked pro boxer sums up its effects: “I had even greater speed and explosiveness and I was able to maintain this for the whole match… I had gas to sell.”A military special operator, on the wrong side of 40, reports: “a speed increase in all my powerlifts… pain relief in all of my injuries… an increase in my endurance while doing combatives… increased striking power…”Q&D can be a minimalist’s stand-alone total training regimen—or be plugged into any athlete’s regimen. It takes only 12–30min, two to three times per week. Additional benefits may include:Increased testosteroneDecreased cortisolImproved heart rate variabilityReduced body fatImproved soft tissue qualityAll this without getting \"smoked\"—because you need energy to fight, work, play, live.",
    "img_url": "https://s3proxy.cdn-zlib.se/covers299/collections/genesis/7e145946f0f25cfd5694e878e45b95dca92900a184c6dbe599b87d0cfaaa4008.jpg",
    "Categories": "Self-Help, Relationships & Lifestyle - Exercise & Fitness",
    "Year": "2019",
    "Publisher": "StrongFirst, Inc.",
    "Language": "english",
    "Pages": "114",
    "ISBN 10": "0989892425",
    "ISBN 13": "9780989892421",
    "File": "EPUB, 3.85 MB",
    "IPFS CID": "QmchRYf6US6GNwf5wVCMHNRReWAxsA2pUxjC86oEWkYBRP",
    "IPFS CID blake2b": "bafykbzacebdgmnz656c43z4en3x4hfgrfo2gurn6lll5slp4uvkmcsyqqwi5c"
}