{
    "title": "IoT-enabled Smart Healthcare Systems, Services and Applications",
    "author": "Various Autors",
    "desc": "IoT-Enabled Smart Healthcare Systems, Services and Applications Explore the latest healthcare applications of cutting-edge technologies In IoT-Enabled Smart Healthcare Systems, Services and Applications, an accomplished team of researchers delivers an insightful and comprehensive exploration of the roles played by cutting-edge technologies in modern healthcare delivery. The distinguished editors have included resources from a diverse array of learned experts in the field that combine to create a broad examination of a rapidly developing field. With a particular focus on Internet of Things (IoT) technologies, readers will discover how new technologies are impacting healthcare applications from remote monitoring systems to entire healthcare delivery methodologies. After an introduction to the role of emerging technologies in smart health care, this volume includes treatments of ICN-Fog computing, edge computing, security and privacy, IoT architecture, vehicular ad-hoc networks (VANETs), and patient surveillance systems, all in the context of healthcare delivery. Readers will also find: A thorough introduction to ICN-Fog computing for IoT based healthcare, including its architecture and challenges Comprehensive explorations of Internet of Things enabled software defined networking for edge computing in healthcare Practical discussions of a review of e-healthcare systems in India and Thailand, as well as the security and privacy issues that arise through the use of smart healthcare systems using Internet of Things devices In-depth examinations of the architecture and applications of an Internet of Things based healthcare system Perfect for healthcare practitioners and allied health professionals, hospital administrators, and technology professionals, IoT-Enabled Smart Healthcare Systems, Services and Applications is an indispensable addition to the libraries of healthcare regulators and policymakers seeking a one-stop resource that explains cutting-edge technologies in modern healthcare.",
    "img_url": "https://s3proxy.cdn-zlib.se/covers299/collections/userbooks/cfe06c6d2a6b858f3c6a759a3b0b04adf0d9c15c32ca71bbbce847e4c13dccb7.jpg",
    "Categories": "Biology and other natural sciences - Biotechnology",
    "Year": "2022",
    "Edition": "1",
    "Publisher": "Wiley",
    "Language": "english",
    "Pages": "241",
    "ISBN 10": "1119816793",
    "ISBN 13": "9781119816799",
    "File": "PDF, 5.84 MB",
    "IPFS CID": "Qmdhe58euLZQADVcC9kdnggRPdr7tjddj4E7NKAHPmcDqy",
    "IPFS CID blake2b": "bafykbzaced7fs3rjjzfeom57jtokqj2plzvsp2v6fgybgw43baapey5wtkf5u"
}