{
    "title": "Pharmacotherapy: A Pathophysiologic Approach, Eleventh Edition",
    "author": "Joseph DiPiro",
    "desc": "Publisher's Note: Products purchased from Third Party sellers are not guaranteed by the publisher for quality, authenticity, or access to any online entitlements included with the product.25+ additional chapters available online!The classic guide to driving optimal patient outcomes using evidence-based medication therapies―updated with the latest advances and guidelinesA  Doody's Core Title for 2020! ALL E-CHAPTERS (ONLINE ONLY CHAPTERS) NOW AVAILABLE FREE go to https://accesspharmacy.mhmedical.com/book.aspx?bookID=2577Presented in full color, Pharmacotherapy: A Pathophysiologic Approach, 11th Edition helps you deliver the highest-quality patient care through evidence-based medication therapy derived from sound pharmacotherapeutic principles. It takes you beyond drug indications and dosages,  showing how to properly select, administer, and monitor drugs―everything you need to provide safe, effective drug therapy across all therapeutic categories. With all-new monitoring tables and authoritative content from 300 expert contributors, this new edition has been fully updated to reflect the latest evidence-based information and recommendations. You’ll find Key Concepts at the beginning of each chapter, Clinical Presentation tables that summarize disease signs and symptoms, and Clinical Controversies boxes that examine the complicated issues faced by students and clinicians in providing drug therapy.Why Pharmacotherapy: A Pathophysiologic Approach is perfect for students, pharmacists, and other healthcare providers:•  All chapters provide the most current, reliable, and relevant information available.•  Key concepts kick off every chapter.•  Clinical Presentation Tables summarize disease signs and symptoms.•  The majority of sections include personalized pharmacotherapy content.•  Clinical Controversies Boxes clarify the most complex drug therapy issues you’ll face.•  Diagnostic flow diagrams, treatment algorithms, dosing recommend",
    "img_url": "https://s3proxy.cdn-zlib.se/covers299/collections/genesis/208e1b6126ca850a75a923615c6dcfc9dc3c8715cac44f177ff5b8d4581aea81.jpg",
    "Categories": "Medicine - Pharmacology",
    "Year": "2020",
    "Edition": "11",
    "Publisher": "McGraw-Hill Education / Medical",
    "Language": "english",
    "Pages": "2672",
    "ISBN 10": "1260116816",
    "ISBN 13": "9781260116816",
    "File": "EPUB, 112.04 MB",
    "IPFS CID": "QmeBP87EpJspinvfXUMjFsP9ziU6T5iVLs26ysB7it7xAG",
    "IPFS CID blake2b": "bafykbzacebyoyuxd5ajtqdbavbtexasq3r3tp6icceskwkx7moy2kim747h3q"
}