{
    "title": "Kozier Erbs Fundamentals of Nursing Concepts, Process and Practice [RENTAL EDITION] (11th Edition) by Audrey T. Berman, Shirlee Snyder, Geralyn Frandsen EdD MSN RN (z-lib.org)",
    "author": "by Audrey T. Berman",
    "desc": "Main Kozier & Erb's Fundamentals of Nursing: Concepts, Process and Practice [RENTAL EDITION] (11th...Kozier & Erb's Fundamentals of Nursing: Concepts, Process and Practice [RENTAL EDITION] (11th Edition)Audrey T. Berman, Shirlee Snyder, Geralyn Frandsen EdD MSN RN0 / 0 0 comments This print textbook is available for students to rent for their classes. The Pearson print rental program provides students with affordable access to learning materials, so they come to class ready to succeed.For courses in the fundamentals of nursing.This ISBN is for the bound textbook, which students can rent through their bookstore.Preparing students to succeed in modern nursing careersNurses today must grow and evolve to meet the demands of a dramatically changing healthcare system.  Kozier & Erb's Fundamentals of Nursing  addresses the concepts of contemporary professional nursing that students need to succeed in today’s environment. From the integral aspects of nursing, such as managing and communicating, to assessing health and client care, the text sets the foundation for nursing excellence. To help students develop their clinical-reasoning abilities, QSEN features throughout the 11th Edition draw connections to actual nursing practice. Students will learn to think like nurses as they see how the material they are reading is applied in nursing practice. Other updates include new examples, additional photos, and the latest standards of care. This title is also available  digitally as a standalone  Pearson eText ,  or via  MyLab Nursing  which includes the Pearson eText.  These options give students affordable access to learning materials, so they come to class ready to succeed.Categories:MedicineYear:2020Edition:11Publisher:PearsonLanguage:EnglishPages:1632 / 1553ISBN 10:0135428734File:PDF, 146.32 MB Download (pdf, 146.32 MB)Toggle Dropdown Preview Send-to-Kindle or Email You may be interested inPowered by Rec2Me",
    "img_url": "https://s3proxy.cdn-zlib.se/covers299/collections/userbooks/053848609149d60cbbb9e573ca4327a1dd854b14960c51489285ff6ff0adc628.jpg",
    "Categories": "Medicine - Nursing",
    "Year": "2021",
    "Edition": "11",
    "Language": "english",
    "File": "PDF, 123.06 MB",
    "IPFS CID": "QmfS2QdWVAdLfa8Cu7haEhfjaszWtnrcQmzrviYLhhwZSt",
    "IPFS CID blake2b": "bafykbzaced23fxiki2i5pr4hzqxrlwxao3ii34ui3sp3nuubs4tuczlfrrqwy"
}