{
    "title": "Echi in tempesta. L'Attraversaspecchi - 4",
    "author": "Christelle Dabos",
    "desc": "Nell’ultimo avvincente capitolo della saga, Christelle Dabos ci trasporta, con la potenza suggestiva del suo ritmo incalzante, in un grande gioco di fantasia avvinto alle vicende fin troppo umane dei suoi protagonisti. Ofelia e Thorn affrontano un universo colmo di allegorie e di realtà interiori profonde, di orizzonti antichi e di sentimenti nuovi, fino a scovare la verità che da sempre è nascosta dietro lo specchio. Crollati gli ultimi muri della diffidenza, Ofelia e Thorn si amano ormai appassionatamente. Tuttavia non possono farlo alla luce del sole: la loro unione deve infatti rimanere nascosta perché possano continuare a indagare di concerto sull’indecifrabile codice di Dio e sulla misteriosa figura dell’Altro, l’essere di cui non si conosce l’aspetto, ma il cui potere devastante continua a far crollare interi pezzi di arche precipitando nel vuoto migliaia di innocenti. Come trovare l’Altro, senza sapere nemmeno com’è fatto? Più uniti che mai, ma impegnati su piste diverse, Ofelia e Thorn approderanno all’osservatorio delle Deviazioni, un istituto avvolto dal segreto più assoluto e gestito da una setta di scienziati mistici in cui, dietro la facciata di una filantropica clinica psichiatrica, si cela un laboratorio dove vengono condotti esperimenti disumani e terrificanti. È lì che si recheranno i due, lì scopriranno le verità che cercano e da lì proveranno a fermare i crolli e a riportare il mondo in equilibrio.",
    "img_url": "https://s3proxy.cdn-zlib.se/covers299/collections/userbooks/a00b0af40ddc1d7fb8ac9a63fdb3546bfcc04b566df5c4ced5c9dc0516389e08.jpg",
    "Categories": "Science Fiction - Fantasy Fiction",
    "Year": "2020",
    "Publisher": "E/O Edizioni",
    "Language": "italian",
    "Pages": "576",
    "ISBN 10": "8833572528",
    "ISBN 13": "9788833572529",
    "ISBN": "B088KQSGDZ",
    "File": "EPUB, 472 KB",
    "IPFS CID": "QmNRZARuKp3bNewzQAkNxyM4TW8fZa3yDDSs72MLN3k4KE",
    "IPFS CID blake2b": "bafykbzaceds5pyofqs63on5oligqtaogm3vhgmuq3mdjyg63y233khhswjqzc"
}