{
    "title": "Managing in the Gray: Five Timeless Questions for Resolving Your Toughest Problems at Work",
    "author": "Joseph L. Badaracco Jr.",
    "desc": "How to Resolve the Really Hard ProblemsEvery manager makes tough callsit comes with the job. And the hardest decisions are the gray areas”situations where you and your team have worked hard to find an answer, you’ve done the best analysis you can, and you still don’t know what to do. But you have to make a decision. You have to choose, commit, act, and live with the consequences and persuade others to follow your lead. Gray areas test your skills as a manager, your judgment, and even your humanity. How do you get these decisions right?In Managing in the Gray, Joseph Badaracco offers a powerful, practical, and even radical way to resolve these problems. Picking up where conventional tools of analysis leave off, this book provides tools for judgment in the form of five revealing questions. Asking yourself these five questions provides a simple yet profound way to broaden your thinking, sharpen your judgment, and develop a fresh perspective. What makes these questions so valuable is that they have truly stood the test of timethey’ve guided countless men and women, across many centuries and cultures, to resolve the hardest questions of work, responsibility, and life.You can use the five-question framework on your own or with others on your team to help you cut through complexities, understand critical trade-offs, and develop workable solutions for even the grayest issues.",
    "img_url": "https://s3proxy.cdn-zlib.se/covers299/collections/genesis/5972bc0bec31aba3ac927ccb363560c1dbc056a7f41397bdf90c7202eb6957a7.jpg",
    "Categories": "Business & Economics - Responsibility and Business Ethics",
    "Year": "2016",
    "Publisher": "Harvard Business Review Press",
    "Language": "english",
    "Pages": "208",
    "ISBN 10": "1633691748",
    "ISBN 13": "9781633691742",
    "File": "RAR, 605 KB",
    "IPFS CID": "QmeWypGRsFPMYAC56oMNy57XaZECtXE8GYy8XcwH3bCyMF",
    "IPFS CID blake2b": "bafykbzacearr4jrbp455kvia6jrxnhhoesrhq7hvag6sejpyub3ts7ln64nuc"
}