{
    "title": "The Geopolitics of U.S. Overseas Troops and Withdrawal",
    "author": "Jo Jakobsen",
    "desc": "Why is it so difficult for a great power or a hegemon to retrench its overseas military power? Specifically, why are U.S. military bases and troops still largely where they were five years ago, twenty years ago, or even seventy years ago? Through developing a theory of great-power persistence, this book offers an explanation. Closely aligned with neoclassical realism, the theory argues that the murkiness of the anarchic international system combines with specific psychological inclinations of individuals to produce “better-safe-than-sorry” policies. In the United States, decisions on troop deployments are powerfully influenced by the broader foreign-policy community. Its members tend to be risk-averse and highly sensitive to the possibility that even minor troop withdrawals might set off harmful geopolitical chain reactions. Preferring the status quo over any uncertain alternative, they want their country to continue to maximize its influence and project its military power abroad in order to steady wobbling geopolitical “dominoes.” The theory is put to the empirical test through a systematic analysis of U.S. overseas troop deployments, withdrawal attempts, and retrenchment resistance during the presidency of Donald Trump, which represents an ideal test case for these mechanisms. Even if U.S. voters elected a retrenchment advocate as president, and despite that the United States is a gradually declining power, the period saw very little change in U.S. overseas troop deployments. The book concludes that, barring any dramatic, unforeseeable international event, the vast network of overseas U.S. military bases and troops is likely to persist for a long time to come.",
    "img_url": "https://s3proxy.cdn-zlib.se/covers299/collections/userbooks/31a71ec4ee62f6f59ccf23406655ae65578318423077a5108a28753e8cd4529a.jpg",
    "Categories": "Society, Politics & Philosophy - Warfare & Defence",
    "Year": "2022",
    "Publisher": "Palgrave Macmillan",
    "Language": "english",
    "Pages": "317",
    "ISBN 10": "3030944875",
    "ISBN 13": "9783030944872",
    "File": "PDF, 5.66 MB",
    "IPFS CID": "QmR9jZYJFd6ii2Yp2FZKCSK1oqPd7QPFDcQshtboPfFAcL",
    "IPFS CID blake2b": "bafykbzaceb5vifal3nuvivzyref2n5qb76t4l6quedkfzczudtg25r62bd25s"
}