{
    "title": "Advanced time series data analysis: forecasting using EViews",
    "author": "Agung",
    "desc": "Introduces the latest developments in forecasting in advanced quantitative data analysis This book presents advanced univariate multiple regressions, which can directly be used to forecast their dependent variables, evaluate their in-sample forecast values, and compute forecast values beyond the sample period. Various alternative multiple regressions models are presented based on a single time series, bivariate, and triple time-series, which are developed by taking into account specific growth patterns of each dependent variables, starting with the simplest model up to the most advanced model. Graphs of the observed scores and the forecast evaluation of each of the models are offered to show the worst and the best forecast models among each set of the models of a specific independent variable. Advanced Time Series Data Analysis: Forecasting Using EViews provides readers with a number of modern, advanced forecast models not featured in any other book. They include various interaction models, models with alternative trends (including the models with heterogeneous trends), and complete heterogeneous models for monthly time series, quarterly time series, and annually time series. Each of the models can be applied by all quantitative researchers. -Presents models that are all classroom tested -Contains real-life data samples -Contains over 350 equation specifications of various time series models -Contains over 200 illustrative examples with special notes and comments -Applicable for time series data of all quantitative studies Advanced Time Series Data Analysis: Forecasting Using EViews will appeal to researchers and practitioners in forecasting models, as well as those studying quantitative data analysis. It is suitable for those wishing to obtain a better knowledge and understanding on forecasting, specifically the uncertainty of forecast values.   Abstract: Introduces the latest developments in forecasting in advanced quantitative data analysis This book presents advanced univariate multiple regressions, which can directly be used to forecast their dependent variables, evaluate their in-sample forecast values, and compute forecast values beyond the sample period. Various alternative multiple regressions models are presented based on a single time series, bivariate, and triple time-series, which are developed by taking into account specific growth patterns of each dependent variables, starting with the simplest model up to the most advanced model. Graphs of the observed scores and the forecast evaluation of each of the models are offered to show the worst and the best forecast models among each set of the models of a specific independent variable. Advanced Time Series Data Analysis: Forecasting Using EViews provides readers with a number of modern, advanced forecast models not featured in any other book. They include various interaction models, models with alternative trends (including the models with heterogeneous trends), and complete heterogeneous models for monthly time series, quarterly time series, and annually time series. Each of the models can be applied by all quantitative researchers. -Presents models that are all classroom tested -Contains real-life data samples -Contains over 350 equation specifications of various time series models -Contains over 200 illustrative examples with special notes and comments -Applicable for time series data of all quantitative studies Advanced Time Series Data Analysis: Forecasting Using EViews will appeal to researchers and practitioners in forecasting models, as well as those studying quantitative data analysis. It is suitable for those wishing to obtain a better knowledge and understanding on forecasting, specifically the uncertainty of forecast values",
    "img_url": "https://s3proxy.cdn-zlib.se/covers299/collections/genesis/281c4fd80b8805ae456a8fa798f3dd1eb60a7c7b9318e8dda480bfe239ea5b81.jpg",
    "Categories": "Business & Economics - Econometrics",
    "Year": "2019",
    "Publisher": "John Wiley & Sons",
    "Language": "english",
    "Pages": "520/528",
    "ISBN 10": "1119504813",
    "ISBN 13": "9781119504818",
    "File": "PDF, 72.11 MB",
    "IPFS CID": "QmQYtHRwWCeRgGvMPtiRR3Wx1uWx8govUF3L82bw9BWvsv",
    "IPFS CID blake2b": "bafykbzacedcjaztwkr6suuvczaobejxw3e2vxf52ss3ntgfzy43wwvdg5ksec"
}