{
    "title": "Storia universale delle lingue",
    "author": "Harald Haarmann",
    "desc": "Questa Storia universale delle lingue offre per la prima volta al pubblico italiano una panoramica completa delle origini e degli sviluppi del linguaggio nel lungo percorso dell’umanità, seguendo le interazioni fra diverse culture e l’evoluzione linguistica contemporanea.Nell’affascinante intreccio di epoche e civiltà, Harald Haarmann esplora le varie fasi del linguaggio dell’Homo sapiens e ripercorre la teoria nostratica, un’ipotetica superfamiglia linguistica originaria. In modo chiaro e accessibile, l’autore dischiude ai lettori la complessa storia evolutiva delle lingue, la trasformazione e la ramificazione di antichi ceppi, la nascita di nuovi idiomi, senza tralasciare il rapporto fra linguaggio e tecnologia. La sua analisi è resa solida e convincente dalla commistione delle più moderne conoscenze nel campo della genetica umana, dell’archeologia e della storia delle migrazioni, che negli ultimi anni hanno arricchito di molto la linguistica storico-comparativa.Dalla prima edizione nel 2006, questo saggio così imprescindibile nel settore ha avuto numerosi aggiornamenti e traduzioni. La presente edizione comprende una riflessione ampliata sui recenti sviluppi della disciplina, inclusi gli studi sul multilinguismo, sulla progressiva scomparsa delle lingue minori e sul ruolo dell’inglese, che oggi si confronta con processi simili a quelli subiti a suo tempo dal latino. Conoscere la storia delle lingue diventa allora indispensabile per comprendere anche le future tendenze di interazioni culturali sempre più articolate.",
    "img_url": "https://s3proxy.cdn-zlib.se/covers299/collections/userbooks/dc11329d93f12bcdcf6fa77b45088ca9fea0b4b0c6fb17f9d2874e9723151011.jpg",
    "Categories": "Linguistics - Historical & Comparative Linguistics",
    "Year": "2021",
    "Publisher": "Bollati Boringhieri",
    "Language": "italian",
    "ISBN 10": "8833937674",
    "ISBN 13": "9788833937670",
    "File": "EPUB, 5.82 MB",
    "IPFS CID": "QmdunoG3dSrEDBxTbKPJTqgbip3yzWndEAPcbQGV42UFex",
    "IPFS CID blake2b": "bafykbzaceaxhz46iv5uuuxrexbuzzszdxedpqyumqk6zvuugd4uoznr6pps5y"
}